Revit 2027 API
IRevisionsOnSheetUIServer.ShowDialog Method
Note: This API is now obsolete.
 Shows dialog on managing RevisionsOnSheetUI.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")]
bool ShowDialog(
	RevisionsOnSheetUIServiceData data
)
<ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")>
Function ShowDialog (
	data As RevisionsOnSheetUIServiceData
) As Boolean
[ObsoleteAttribute(L"This is deprecated in Revit 2027 and may be removed in a future version of Revit.")]
bool ShowDialog(
	RevisionsOnSheetUIServiceData^ data
)
[<ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")>]
abstract ShowDialog :
        data : RevisionsOnSheetUIServiceData -> bool
Parameters
data RevisionsOnSheetUIServiceData
 The data on initializing the dialog as well as getting the result.
Return Value
Boolean
 Whether or not the dialog launches successfully
See Also
Reference
IRevisionsOnSheetUIServer Interface
Autodesk.Revit.UI Namespace